import styled from "styled-components";
import AccordionItem from "./AccordionItem";

const StyledAccordion = styled.div`
  display: flex;
  flex-direction: column;
  margin: 0 2rem;

  gap: 4rem;
`;

const Accordion = () => {
  const data = [
    {
      id: 1,
      question: "سوال مهم اول نیشستیشسیاش؟",
      anwser: `
    مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری
    زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری زبان انگلیسی
    است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر
    یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری زبان
    انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری
    زبان انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی
    شما در مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر
    یادگیری زبان انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد
    نهایی شما در مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است.`,
    },
    {
      id: 2,
      question: "سوال مهم دوم؟",
      anwser: `
    مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری
    زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری زبان انگلیسی
    است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر
    یادگیری زبان انگلیسی است. اینجا مقصد نی زبان انگلیسی است. اینجا مقصد نهایی
    شما در مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر
    یادگیری زبان انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد
    نهایی شما در مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است.`,
    },
    {
      id: 3,
      question: "سوال مهم سوم؟",
      anwser: `
    مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری
    زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری زبان انگلیسی
    است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر
    یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری زبان
    انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است. اینجا مانگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است.`,
    },
    {
      id: 4,
      question: "سوال مهم چهارم؟",
      anwser: `
    مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری
    زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری زبان انگلیسی
    است. مسیر یادگیری زبان انگلیسی است. ان انگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر یادگیری
    زبان انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی
    شما در مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در مسیر
    یادگیری زبان انگلیسی است. مسیر یادگیری زبان انگلیسی است. اینجا مقصد
    نهایی شما در مسیر یادگیری زبان انگلیسی است. اینجا مقصد نهایی شما در
    مسیر یادگیری زبان انگلیسی است.`,
    },
  ];

  return (
    <StyledAccordion>
      {data.map((accordionItem) => (
        <AccordionItem accordionItem={accordionItem} key={accordionItem.id} />
      ))}
    </StyledAccordion>
  );
};

export default Accordion;
